Running Terraform with a FQDN as "domain":

```
jeroen_g@DESKTOP-I7N1FMF:~/oci_jeroen_g_vcn$ cat 12_rrset.tf

resource "oci_dns_rrset" "rrset-a" {
  zone_name_or_id = oci_dns_zone.oci.name
  domain          = oci_dns_zone.oci.name
  rtype           = "A"
  scope           = "PRIVATE"
  view_id         = oci_dns_view.amis_com_view.id

  items {
    domain = "demo.oci.amis.com"  #<------
    rtype  = "A"
    rdata  = "10.10.10.10"
    ttl    = 3600
  }

}

jeroen_g@DESKTOP-I7N1FMF:~/oci_jeroen_g_vcn$ terraform apply
data.oci_identity_tenancy.tenancy: Reading...
oci_dns_view.amis_com_view: Refreshing state... [id=ocid1.dnsview.oc1.eu-frankfurt-1.amaaaaaajgv45niatcp6vpc6fcdiiup4kho4hgmjhqbiys63co4rh4b7hs2a]
data.oci_identity_tenancy.tenancy: Read complete after 0s [id=ocid1.tenancy.oc1..aaaaaaaahsph644kt7bs5ntwm34umzcij2u27uwclw7pkwex4xose6bh6azq]
data.oci_dns_zones.zs: Reading...
oci_dns_zone.oci: Refreshing state... [id=ocid1.dns-zone.oc1.eu-frankfurt-1.aaaaaaaavujqaodwlpykictsal7cvptoakucfr5l52nwf3u7yown4cfytwrq]
data.oci_dns_zones.zs: Read complete after 0s [id=DnsZonesDataSource-1033150771]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_dns_rrset.rrset-a will be created
  + resource "oci_dns_rrset" "rrset-a" {
      + compartment_id  = (known after apply)
      + domain          = "oci.amis.com"
      + id              = (known after apply)
      + rtype           = "A"
      + scope           = "PRIVATE"
      + view_id         = "ocid1.dnsview.oc1.eu-frankfurt-1.amaaaaaajgv45niatcp6vpc6fcdiiup4kho4hgmjhqbiys63co4rh4b7hs2a"
      + zone_name_or_id = "oci.amis.com"

      + items {
          + domain        = "demo.oci.amis.com"
          + is_protected  = (known after apply)
          + rdata         = "10.10.10.10"
          + record_hash   = (known after apply)
          + rrset_version = (known after apply)
          + rtype         = "A"
          + ttl           = 3600
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

oci_dns_rrset.rrset-a: Creating...
╷
│ Error: 400-InvalidParameter, Domain in record data (demo.oci.amis.com) does not match the domain in path (oci.amis.com)
│ Suggestion: Please update the parameter(s) in the Terraform config as per error message Domain in record data (demo.oci.amis.com) does not match the domain in path (oci.amis.com)
│ Documentation: https://registry.terraform.io/providers/oracle/oci/latest/docs/resources/dns_rrset
│ API Reference: https://docs.oracle.com/iaas/api/#/en/dns/20180115/RRSet/UpdateRRSet
│ Request Target: PUT https://dns.eu-frankfurt-1.oci.oraclecloud.com/20180115/zones/oci.amis.com/records/oci.amis.com/A?scope=PRIVATE&viewId=ocid1.dnsview.oc1.eu-frankfurt-1.amaaaaaajgv45niatcp6vpc6fcdiiup4kho4hgmjhqbiys63co4rh4b7hs2a
│ Provider version: 5.4.0, released on 2023-07-12. This provider is 3 Update(s) behind to current.
│ Service: Dns Rrset
│ Operation Name: UpdateRRSet
│ OPC request ID: fb584974aff5c7076b2fff935a732fec/DD1E6181FA74AECAECD0556BA12B5D2C/DAC3288308A74B6C212748028F588EF5
│
│
│   with oci_dns_rrset.rrset-a,
│   on 12_rrset.tf line 2, in resource "oci_dns_rrset" "rrset-a":
│    2: resource "oci_dns_rrset" "rrset-a" {
│
╵
jeroen_g@DESKTOP-I7N1FMF:~/oci_jeroen_g_vcn$
```

Changing the FQDN to only the domain (oci.amis.com) :
```
jeroen_g@DESKTOP-I7N1FMF:~/oci_jeroen_g_vcn$ cat 12_rrset.tf

resource "oci_dns_rrset" "rrset-a" {
  zone_name_or_id = oci_dns_zone.oci.name
  domain          = oci_dns_zone.oci.name
  rtype           = "A"
  scope           = "PRIVATE"
  view_id         = oci_dns_view.amis_com_view.id


  items {
    domain = "oci.amis.com"   #<------
    rtype  = "A"
    rdata  = "10.10.10.10"
    ttl    = 3600
  }

}

jeroen_g@DESKTOP-I7N1FMF:~/oci_jeroen_g_vcn$ terraform apply
data.oci_identity_tenancy.tenancy: Reading...
oci_dns_view.amis_com_view: Refreshing state... [id=ocid1.dnsview.oc1.eu-frankfurt-1.amaaaaaajgv45niatcp6vpc6fcdiiup4kho4hgmjhqbiys63co4rh4b7hs2a]
data.oci_identity_tenancy.tenancy: Read complete after 0s [id=ocid1.tenancy.oc1..aaaaaaaahsph644kt7bs5ntwm34umzcij2u27uwclw7pkwex4xose6bh6azq]
data.oci_dns_zones.zs: Reading...
oci_dns_zone.oci: Refreshing state... [id=ocid1.dns-zone.oc1.eu-frankfurt-1.aaaaaaaavujqaodwlpykictsal7cvptoakucfr5l52nwf3u7yown4cfytwrq]
data.oci_dns_zones.zs: Read complete after 0s [id=DnsZonesDataSource-1033150771]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_dns_rrset.rrset-a will be created
  + resource "oci_dns_rrset" "rrset-a" {
      + compartment_id  = (known after apply)
      + domain          = "oci.amis.com"
      + id              = (known after apply)
      + rtype           = "A"
      + scope           = "PRIVATE"
      + view_id         = "ocid1.dnsview.oc1.eu-frankfurt-1.amaaaaaajgv45niatcp6vpc6fcdiiup4kho4hgmjhqbiys63co4rh4b7hs2a"
      + zone_name_or_id = "oci.amis.com"

      + items {
          + domain        = "oci.amis.com"
          + is_protected  = (known after apply)
          + rdata         = "10.10.10.10"
          + record_hash   = (known after apply)
          + rrset_version = (known after apply)
          + rtype         = "A"
          + ttl           = 3600
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

oci_dns_rrset.rrset-a: Creating...
oci_dns_rrset.rrset-a: Creation complete after 0s [id=zoneNameOrId/oci.amis.com/domain/oci.amis.com/rtype/A]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

zones = tolist([
  {
    "compartment_id" = "ocid1.compartment.oc1..aaaaaaaa4f7jbvaiosvemj3wm7woxtiidb4fljot6xqikmejxbl44kv32d7q"
    "defined_tags" = tomap({
      "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jeroen.gouma@amis.nl"
    })
    "external_downstreams" = tolist([])
    "external_masters" = tolist([])
    "freeform_tags" = tomap({})
    "id" = "ocid1.dns-zone.oc1.eu-frankfurt-1.aaaaaaaavujqaodwlpykictsal7cvptoakucfr5l52nwf3u7yown4cfytwrq"
    "is_protected" = false
    "name" = "oci.amis.com"
    "nameservers" = tolist([])
    "scope" = "PRIVATE"
    "self" = "https://dns.eu-frankfurt-1.oci.oraclecloud.com/20180115/zones/ocid1.dns-zone.oc1.eu-frankfurt-1.aaaaaaaavujqaodwlpykictsal7cvptoakucfr5l52nwf3u7yown4cfytwrq"
    "serial" = 3
    "state" = "ACTIVE"
    "time_created" = "2023-08-03 06:02:32.27 +0000 UTC"
    "version" = "3"
    "view_id" = "ocid1.dnsview.oc1.eu-frankfurt-1.amaaaaaajgv45niatcp6vpc6fcdiiup4kho4hgmjhqbiys63co4rh4b7hs2a"
    "zone_transfer_servers" = tolist([])
    "zone_type" = "PRIMARY"
  },
])
jeroen_g@DESKTOP-I7N1FMF:~/oci_jeroen_g_vcn$

```

When entering a new DNS record via the webinterface everything works as expected, adding a FQDN as new A-record is no problem.

